'''
import sys
sys.path.append(
	"/sdcard/[GuoYufan]/[Python]/XDDQ/寻道大千_新号无灵兽阶段计算器_用于23级筑基前期之前//v1_0_6_a/")
del sys
from v1_0_7 import *
'''


#'''
import os

here=__file__
#当设置为1 为回退到最底层目录
回退到上几级目录=7
for i in range(回退到上几级目录):
    here=os.path.dirname(here)
del 回退到上几级目录,i
#input(here)

import sys
sys.path.append(
	here+
 os.sep.join("/[GuoYufan]/[Python]/XDDQ/寻道大千_新号无灵兽阶段计算器_用于23级筑基前期之前/v1_0_7".split("/"))
)
#input(sys.path[-1])
del sys,os

from Role import *
from	Fight import *
from	Stat import *
#'''

    
def main():    
    # 怪：《冒险1-10》
    # 8回合暴击1次反击2次
    #敌=Role([5135,740,148,300])

    # 怪：《冒险小村庄2-6》
    # 胜率：61.3%（6回合连击一次暴击两次）
    # 对我=Role([7312,1104,179,299],"我")
    #敌=Role([6854,1475,246,292],"敌")
    
    # 怪：《冒险小村庄2-7》
    # 胜率：75%（6回合连击一次暴击两次闪避一次）
    # 对我=Role([7671,1150,187,323],"我")
    #敌=Role([7025,1511,252,301],"敌")
    
    # 怪：《冒险小村庄2-8》
    # 胜率：75%（6回合一连一暴）
    # 对我=Role([7918,1193,194,347],"我")
    #敌=Role([7194,1547,258,309],"敌")
    
    # 怪：《冒险小村庄2-10》
    # 胜率：0%
    # 对我=Role([8036,1212,197,355],"我")
    # 胜率：98%~99%（4连对2连）
    #	对我=Role([9652,1448,234,413],"我")
    #敌=Role([9861,1421,284,359],"敌")
    
    # 《冒险3-1》
    # 胜率：100%（2连1暴6回合）
    #对我=Role([10031,1506,245,425],"我")
    #敌=Role([10345,1490,298,377],"敌")
    
    # 《冒险3-2》
    # 胜率：34%（1反4连对1连）
    #对我=Role([10031,1506,245,425],"我")
    #敌=Role([11562,1667,333,451],"敌")
    
    # 《冒险3-3》
    # 胜率：33%（胜）
    #对我=Role([10751,1615,260,465],"我")
    #敌=Role([13440,1935,387,574],"敌")
    
    
    # 胜率：1%~3%
    #对我=Role([11968,1770,290,496],"我")
    敌=Role([14445,2080,416,631],"敌")
    
    # --- 斗法 ---
    # （被打：斗法记录里来欺负人的3倍对手）
    #敌=Role([15947,2357,390,653],"敌")
    
    # （去打：两次没打过）
    #敌=Role([8339,1258,203,384],"敌")
    
    # （理论25%胜率白板压至76%~连击压至88%，火力全开可压至158%血线。）
    # （去打：三次没打过。不止连击18.6%，还会闪避会反击）
    # 对我=Role([8318,1253,204,355],"我")
    #敌=Role([8582,1300,211,392],"敌")
    
    #敌=Role([8121,1218,196,356],"敌")
    
    
    我=Role([11968,1770,290,496],"我")
    
    
    # 用于打怪可设均抗均属
    def 冒险怪(敌):
        敌.基础属性列表=[14445,2080,416,631]
        敌.设置战斗抗性(2.6,"抗暴",7.8)
        敌.设置战斗属性(1)
        	
    # 胜率13%
    def 斗法(敌):
        敌.基础属性列表=[11983,1792,290,552]
        敌.战斗抗性之抗连=敌.战斗抗性之抗暴=敌.战斗抗性之抗吸=0
        敌.战斗属性之吸血=14.4
        敌.战斗属性之连击=17.5
        敌.战斗属性之暴击=5
    
    # 用于比较装备哪个更好？（当然，不一定能比较出来。因为应当与实际对手比较。）
    def 自己打自己():
        我.使双方战斗属性与抗性完全相等()
        我.战斗属性之吸血+=3.8
        我.战斗属性之连击-=3.1
    
    我.战斗属性之吸血=(4.4,3.8)[1]
    我.战斗属性之连击=(17,15.5)[1]
    我.战斗属性之暴击=(10.1,13.4)[1]
    我.战斗抗性之抗吸=12
    我.战斗抗性之抗连=12
    我.战斗抗性之抗暴=12
    
    
    冒险怪(敌)
    #斗法(敌)
    #自己打自己(敌)
    

  
    
    战场=Fight(我,敌)
    print(f"敌基础属性:{敌.基础属性列表}")
    print(f"我基础属性:{我.基础属性列表}")
    print("敌是我的几倍：%s"%("~".join([str(a/b) for a,b in zip(敌.基础属性列表,我.基础属性列表)])))
    
    print("\x1b[7m",end="")
    print("\n\t《战场：模糊战况报告》\t",end="")
    print("\033[0m")
    战场.模糊战况报告()
    
    print("\x1b[7m",end="")
    print("\n\t《战场：准确战况报告》\t",end="")
    print("\033[0m")
    战场.记者重新入场()
    
    # 这个开关最关键，要关闭时只要调一个就好了，其他不用管
    #战场.我方.限定连击吗=True
    #战场.我方.整场连击限定回合数=5
    #战场.我方.限定连击之第一回合是否可连击=True
   
    战场.第一场()
    战场.第二场()
    战场.第三场()
    战场.第四场()
    战场.记者重新入场()
    战场.重新进行一百场()
    while True:
        if 战场.再来多少场()=="quit":break
            

                
if __name__=="__main__":
    main()